witalis3/UA3REO-DDC-Transceiver/STM32/Src/system_menu.c
void SYSMENU_AUDIO_HPF_CW_HOTKEY(void)
{
	sysmenu_handlers_selected = (struct sysmenu_item_handler *)&sysmenu_audio_handlers[0];
	sysmenu_item_count_selected = (uint8_t *)&sysmenu_audio_item_count;
	systemMenuIndex = 9;
	LCD_redraw(false);
}

void SYSMENU_AUDIO_SQUELCH_HOTKEY(void)
{
	sysmenu_handlers_selected = (struct sysmenu_item_handler *)&sysmenu_audio_handlers[0];
	sysmenu_item_count_selected = (uint8_t *)&sysmenu_audio_item_count;
	sysmenu_onroot = false;
	systemMenuIndex = 15;
	LCD_redraw(false);
}

void SYSMENU_AUDIO_AGC_HOTKEY(void)
{
	sysmenu_handlers_selected = (struct sysmenu_item_handler *)&sysmenu_audio_handlers[0];
	sysmenu_item_count_selected = (uint8_t *)&sysmenu_audio_item_count;
	sysmenu_onroot = false;
	systemMenuIndex = 24;
	LCD_redraw(false);
}

static void SYSMENU_HANDL_AUDIO_IFGain(int8_t direction)
{
	TRX.IF_Gain += direction;
	if (TRX.IF_Gain < 1)
		TRX.IF_Gain = 1;
	if (TRX.IF_Gain > 80)
		TRX.IF_Gain = 80;
}

static void SYSMENU_HANDL_AUDIO_AGC_GAIN_TARGET(int8_t direction)
{
	TRX.AGC_GAIN_TARGET += direction;
	if (TRX.AGC_GAIN_TARGET < -80)
		TRX.AGC_GAIN_TARGET = -80;
	if (TRX.AGC_GAIN_TARGET > -10)
		TRX.AGC_GAIN_TARGET = -10;
}

static void SYSMENU_HANDL_AUDIO_MIC_Gain(int8_t direction)
{
	TRX.MIC_GAIN += direction;
	if (TRX.MIC_GAIN < 1)
		TRX.MIC_GAIN = 1;
	if (TRX.MIC_GAIN > 20)
		TRX.MIC_GAIN = 20;
}

static void SYSMENU_HANDL_AUDIO_DNR_THRES(int8_t direction)
{
	TRX.DNR_SNR_THRESHOLD += direction;
	if (TRX.DNR_SNR_THRESHOLD < 1)
		TRX.DNR_SNR_THRESHOLD = 1;
	if (TRX.DNR_SNR_THRESHOLD > 100)
		TRX.DNR_SNR_THRESHOLD = 100;
}

static void SYSMENU_HANDL_AUDIO_DNR_AVERAGE(int8_t direction)
{
	TRX.DNR_AVERAGE += direction;
	if (TRX.DNR_AVERAGE < 1)
		TRX.DNR_AVERAGE = 1;
	if (TRX.DNR_AVERAGE > 100)
		TRX.DNR_AVERAGE = 100;
}

static void SYSMENU_HANDL_AUDIO_DNR_MINMAL(int8_t direction)
{
	TRX.DNR_MINIMAL += direction;
	if (TRX.DNR_MINIMAL < 1)
		TRX.DNR_MINIMAL = 1;
	if (TRX.DNR_MINIMAL > 100)
		TRX.DNR_MINIMAL = 100;
}

static void SYSMENU_HANDL_AUDIO_MIC_EQ_LOW(int8_t direction)
{
	TRX.MIC_EQ_LOW += direction;
	if (TRX.MIC_EQ_LOW < -10)
		TRX.MIC_EQ_LOW = -10;
	if (TRX.MIC_EQ_LOW > 10)
		TRX.MIC_EQ_LOW = 10;
	NeedReinitAudioFilters = true;
}

static void SYSMENU_HANDL_AUDIO_MIC_EQ_MID(int8_t direction)
{
	TRX.MIC_EQ_MID += direction;
	if (TRX.MIC_EQ_MID < -10)
		TRX.MIC_EQ_MID = -10;
	if (TRX.MIC_EQ_MID > 10)
		TRX.MIC_EQ_MID = 10;
	NeedReinitAudioFilters = true;
}

static void SYSMENU_HANDL_AUDIO_MIC_EQ_HIG(int8_t direction)
{
	TRX.MIC_EQ_HIG += direction;
	if (TRX.MIC_EQ_HIG < -10)
		TRX.MIC_EQ_HIG = -10;
	if (TRX.MIC_EQ_HIG > 10)
		TRX.MIC_EQ_HIG = 10;
	NeedReinitAudioFilters = true;
}

static void SYSMENU_HANDL_AUDIO_MIC_REVERBER(int8_t direction)
{
	if (direction > 0 || TRX.MIC_REVERBER > 0)
		TRX.MIC_REVERBER += direction;
	if (TRX.MIC_REVERBER > (AUDIO_MAX_REVERBER_TAPS - 1))
		TRX.MIC_REVERBER = (AUDIO_MAX_REVERBER_TAPS - 1);
	NeedReinitReverber = true;
}

static void SYSMENU_HANDL_AUDIO_RX_EQ_LOW(int8_t direction)
{
	TRX.RX_EQ_LOW += direction;
	if (TRX.RX_EQ_LOW < -10)
		TRX.RX_EQ_LOW = -10;
	if (TRX.RX_EQ_LOW > 10)
		TRX.RX_EQ_LOW = 10;
	NeedReinitAudioFilters = true;
}

static void SYSMENU_HANDL_AUDIO_RX_EQ_MID(int8_t direction)
{
	TRX.RX_EQ_MID += direction;
	if (TRX.RX_EQ_MID < -10)
		TRX.RX_EQ_MID = -10;
	if (TRX.RX_EQ_MID > 10)
		TRX.RX_EQ_MID = 10;
	NeedReinitAudioFilters = true;
}

static void SYSMENU_HANDL_AUDIO_RX_EQ_HIG(int8_t direction)
{
	TRX.RX_EQ_HIG += direction;
	if (TRX.RX_EQ_HIG < -10)
		TRX.RX_EQ_HIG = -10;
	if (TRX.RX_EQ_HIG > 10)
		TRX.RX_EQ_HIG = 10;
	NeedReinitAudioFilters = true;
}

static void SYSMENU_HANDL_AUDIO_RX_AGC_SSB_Speed(int8_t direction)
{
	TRX.RX_AGC_SSB_speed += direction;
	if (TRX.RX_AGC_SSB_speed < 1)
		TRX.RX_AGC_SSB_speed = 1;
	if (TRX.RX_AGC_SSB_speed > 20)
		TRX.RX_AGC_SSB_speed = 20;
}

static void SYSMENU_HANDL_AUDIO_RX_AGC_CW_Speed(int8_t direction)
{
	TRX.RX_AGC_CW_speed += direction;
	if (TRX.RX_AGC_CW_speed < 1)
		TRX.RX_AGC_CW_speed = 1;
	if (TRX.RX_AGC_CW_speed > 20)
		TRX.RX_AGC_CW_speed = 20;
}

static void SYSMENU_HANDL_AUDIO_TX_CompressorSpeed(int8_t direction)
{
	TRX.TX_Compressor_speed += direction;
	if (TRX.TX_Compressor_speed < 1)
		TRX.TX_Compressor_speed = 1;
	if (TRX.TX_Compressor_speed > 10)
		TRX.TX_Compressor_speed = 10;
}

static void SYSMENU_HANDL_AUDIO_TX_CompressorMaxGain(int8_t direction)
{
	TRX.TX_Compressor_maxgain += direction;
	if (TRX.TX_Compressor_maxgain < 1)
		TRX.TX_Compressor_maxgain = 1;
	if (TRX.TX_Compressor_maxgain > 10)
		TRX.TX_Compressor_maxgain = 10;
}

static void SYSMENU_HANDL_AUDIO_FMSquelch(int8_t direction)
{
	if (direction < 0 && CurrentVFO()->FM_SQL_threshold == 0)
		return;
	CurrentVFO()->FM_SQL_threshold += direction;
	if (CurrentVFO()->FM_SQL_threshold > 10)
		CurrentVFO()->FM_SQL_threshold = 10;
	TRX.FM_SQL_threshold = CurrentVFO()->FM_SQL_threshold;

	int8_t band = getBandFromFreq(CurrentVFO()->Freq, true);
	if (band > 0)
		TRX.BANDS_SAVED_SETTINGS[band].FM_SQL_threshold = CurrentVFO()->FM_SQL_threshold;
}

static void SYSMENU_HANDL_AUDIO_VAD_Squelch(int8_t direction)
{
	if (direction > 0)
		TRX.VAD_Squelch = true;
	if (direction < 0)
		TRX.VAD_Squelch = false;
}

static void SYSMENU_HANDL_AUDIO_SSB_HPF_pass(int8_t direction)
{
	if (TRX.SSB_HPF_Filter > 0 || direction > 0)
		TRX.SSB_HPF_Filter += direction * 50;
	if(TRX.SSB_HPF_Filter > MAX_HPF_WIDTH)
		TRX.SSB_HPF_Filter = MAX_HPF_WIDTH;
	
	TRX_setMode(SecondaryVFO()->Mode, SecondaryVFO());
	TRX_setMode(CurrentVFO()->Mode, CurrentVFO());
}

static void SYSMENU_HANDL_AUDIO_CW_HPF_pass(int8_t direction)
{
	if (TRX.CW_HPF_Filter > 0 || direction > 0)
		TRX.CW_HPF_Filter += direction * 50;
	if(TRX.CW_HPF_Filter > MAX_HPF_WIDTH)
		TRX.CW_HPF_Filter = MAX_HPF_WIDTH;
	
	TRX_setMode(SecondaryVFO()->Mode, SecondaryVFO());
	TRX_setMode(CurrentVFO()->Mode, CurrentVFO());
}

static void SYSMENU_HANDL_AUDIO_CW_LPF_pass(int8_t direction)
{
	if (TRX.CW_LPF_Filter > 50 || direction > 0)
		TRX.CW_LPF_Filter += direction * 50;
	if(TRX.CW_LPF_Filter > MAX_LPF_WIDTH_CW)
		TRX.CW_LPF_Filter = MAX_LPF_WIDTH_CW;

	TRX_setMode(SecondaryVFO()->Mode, SecondaryVFO());
	TRX_setMode(CurrentVFO()->Mode, CurrentVFO());
}

static void SYSMENU_HANDL_AUDIO_SSB_LPF_RX_pass(int8_t direction)
{
	if (TRX.SSB_LPF_RX_Filter > 100 || direction > 0)
		TRX.SSB_LPF_RX_Filter += direction * 100;
	if(TRX.SSB_LPF_RX_Filter > MAX_LPF_WIDTH_SSB)
		TRX.SSB_LPF_RX_Filter = MAX_LPF_WIDTH_SSB;

	TRX_setMode(SecondaryVFO()->Mode, SecondaryVFO());
	TRX_setMode(CurrentVFO()->Mode, CurrentVFO());
}

static void SYSMENU_HANDL_AUDIO_SSB_LPF_TX_pass(int8_t direction)
{
	if (TRX.SSB_LPF_TX_Filter > 100 || direction > 0)
		TRX.SSB_LPF_TX_Filter += direction * 100;
	if(TRX.SSB_LPF_TX_Filter > MAX_LPF_WIDTH_SSB)
		TRX.SSB_LPF_TX_Filter = MAX_LPF_WIDTH_SSB;

	TRX_setMode(SecondaryVFO()->Mode, SecondaryVFO());
	TRX_setMode(CurrentVFO()->Mode, CurrentVFO());
}

