witalis3/UA3REO-DDC-Transceiver/STM32/Src/system_menu.c
static void SYSMENU_HANDL_SCREEN_FUNC_BUTTON22(int8_t direction)
{
	if (TRX.FuncButtons[21] > 0 || direction > 0)
		TRX.FuncButtons[21] += direction;
	if (TRX.FuncButtons[21] >= FUNCBUTTONS_COUNT)
		TRX.FuncButtons[21] = FUNCBUTTONS_COUNT - 1;
}

static void SYSMENU_HANDL_SCREEN_FUNC_BUTTON23(int8_t direction)
{
	if (TRX.FuncButtons[22] > 0 || direction > 0)
		TRX.FuncButtons[22] += direction;
	if (TRX.FuncButtons[22] >= FUNCBUTTONS_COUNT)
		TRX.FuncButtons[22] = FUNCBUTTONS_COUNT - 1;
}

static void SYSMENU_HANDL_SCREEN_FUNC_BUTTON24(int8_t direction)
{
	if (TRX.FuncButtons[23] > 0 || direction > 0)
		TRX.FuncButtons[23] += direction;
	if (TRX.FuncButtons[23] >= FUNCBUTTONS_COUNT)
		TRX.FuncButtons[23] = FUNCBUTTONS_COUNT - 1;
}

//ADC/DAC MENU

static void SYSMENU_HANDL_ADCMENU(int8_t direction)
{
#pragma unused(direction)
	sysmenu_handlers_selected = (struct sysmenu_item_handler *)&sysmenu_adc_handlers[0];
	sysmenu_item_count_selected = (uint8_t *)&sysmenu_adc_item_count;
	sysmenu_onroot = false;
	systemMenuIndex = 0;
	LCD_UpdateQuery.SystemMenuRedraw = true;
}

static void SYSMENU_HANDL_ADC_DRIVER(int8_t direction)
{
	if (direction > 0)
		TRX.ADC_Driver = true;
	if (direction < 0)
		TRX.ADC_Driver = false;
	int8_t band = getBandFromFreq(CurrentVFO()->Freq, true);
	if (band > 0)
		TRX.BANDS_SAVED_SETTINGS[band].ADC_Driver = TRX.ADC_Driver;
	FPGA_NeedSendParams = true;
}

static void SYSMENU_HANDL_ADC_PGA(int8_t direction)
{
	if (direction > 0)
		TRX.ADC_PGA = true;
	if (direction < 0)
		TRX.ADC_PGA = false;
	int8_t band = getBandFromFreq(CurrentVFO()->Freq, true);
	if (band > 0)
		TRX.BANDS_SAVED_SETTINGS[band].ADC_PGA = TRX.ADC_PGA;
	FPGA_NeedSendParams = true;
}

static void SYSMENU_HANDL_ADC_RAND(int8_t direction)
{
	if (direction > 0)
		TRX.ADC_RAND = true;
	if (direction < 0)
		TRX.ADC_RAND = false;
	FPGA_NeedSendParams = true;
}

static void SYSMENU_HANDL_ADC_SHDN(int8_t direction)
{
	if (direction > 0)
		TRX.ADC_SHDN = true;
	if (direction < 0)
		TRX.ADC_SHDN = false;
	FPGA_NeedSendParams = true;
}

static void SYSMENU_HANDL_ADC_DITH(int8_t direction)
{
	if (direction > 0)
		TRX.ADC_DITH = true;
	if (direction < 0)
		TRX.ADC_DITH = false;
	FPGA_NeedSendParams = true;
}

//WIFI MENU

static void SYSMENU_HANDL_WIFIMENU(int8_t direction)
{
#pragma unused(direction)
	sysmenu_handlers_selected = (struct sysmenu_item_handler *)&sysmenu_wifi_handlers[0];
	sysmenu_item_count_selected = (uint8_t *)&sysmenu_wifi_item_count;
	sysmenu_onroot = false;
	systemMenuIndex = 0;
	LCD_UpdateQuery.SystemMenuRedraw = true;
}

static void SYSMENU_HANDL_WIFI_RedrawSelectAPMenu(void)
{
	WIFI_State = WIFI_READY;
	LCD_UpdateQuery.SystemMenuRedraw = true;
}

static void SYSMENU_WIFI_DrawSelectAP1Menu(bool full_redraw)
{
	if (full_redraw)
	{
		LCDDriver_Fill(BG_COLOR);
		uint16_t curr_x = 5;
		LCDDriver_printText("NET1 Found:", curr_x, 5, FG_COLOR, BG_COLOR, 2);
		curr_x += 28;
		LCDDriver_printText(">Refresh", 10, curr_x, COLOR_WHITE, BG_COLOR, 2);
		curr_x += 24;
		for (uint8_t i = 0; i < WIFI_FOUNDED_AP_MAXCOUNT; i++)
			LCDDriver_printText((char *)WIFI_FoundedAP[i], 10, curr_x + i * 24, COLOR_GREEN, BG_COLOR, 2);
		LCDDriver_drawFastHLine(0, 49 + sysmenu_wifi_selected_ap_index * 24, LAYOUT->SYSMENU_W, FG_COLOR);
	}
	if (sysmenu_wifi_needupdate_ap)
	{
		if (WIFI_ListAP(SYSMENU_HANDL_WIFI_RedrawSelectAPMenu))
			sysmenu_wifi_needupdate_ap = false;
		else
			LCD_UpdateQuery.SystemMenu = true;
	}
}

static void SYSMENU_WIFI_DrawSelectAP2Menu(bool full_redraw)
{
	if (full_redraw)
	{
		LCDDriver_Fill(BG_COLOR);
		uint16_t curr_x = 5;
		LCDDriver_printText("NET2 Found:", curr_x, 5, FG_COLOR, BG_COLOR, 2);
		curr_x += 28;
		LCDDriver_printText(">Refresh", 10, curr_x, COLOR_WHITE, BG_COLOR, 2);
		curr_x += 24;
		for (uint8_t i = 0; i < WIFI_FOUNDED_AP_MAXCOUNT; i++)
			LCDDriver_printText((char *)WIFI_FoundedAP[i], 10, curr_x + i * 24, COLOR_GREEN, BG_COLOR, 2);
		LCDDriver_drawFastHLine(0, 49 + sysmenu_wifi_selected_ap_index * 24, LAYOUT->SYSMENU_W, FG_COLOR);
	}
	if (sysmenu_wifi_needupdate_ap)
	{
		if (WIFI_ListAP(SYSMENU_HANDL_WIFI_RedrawSelectAPMenu))
			sysmenu_wifi_needupdate_ap = false;
		else
			LCD_UpdateQuery.SystemMenu = true;
	}
}

static void SYSMENU_WIFI_DrawSelectAP3Menu(bool full_redraw)
{
	if (full_redraw)
	{
		LCDDriver_Fill(BG_COLOR);
		uint16_t curr_x = 5;
		LCDDriver_printText("NET3 Found:", curr_x, 5, FG_COLOR, BG_COLOR, 2);
		curr_x += 28;
		LCDDriver_printText(">Refresh", 10, curr_x, COLOR_WHITE, BG_COLOR, 2);
		curr_x += 24;
		for (uint8_t i = 0; i < WIFI_FOUNDED_AP_MAXCOUNT; i++)
			LCDDriver_printText((char *)WIFI_FoundedAP[i], 10, curr_x + i * 24, COLOR_GREEN, BG_COLOR, 2);
		LCDDriver_drawFastHLine(0, 49 + sysmenu_wifi_selected_ap_index * 24, LAYOUT->SYSMENU_W, FG_COLOR);
	}
	if (sysmenu_wifi_needupdate_ap)
	{
		if (WIFI_ListAP(SYSMENU_HANDL_WIFI_RedrawSelectAPMenu))
			sysmenu_wifi_needupdate_ap = false;
		else
			LCD_UpdateQuery.SystemMenu = true;
	}
}

static void SYSMENU_WIFI_SelectAP1MenuMove(int8_t dir)
{
	if (dir < 0 && sysmenu_wifi_selected_ap_index > 0)
		sysmenu_wifi_selected_ap_index--;
	if (dir > 0 && sysmenu_wifi_selected_ap_index < WIFI_FOUNDED_AP_MAXCOUNT)
		sysmenu_wifi_selected_ap_index++;
	SYSMENU_WIFI_DrawSelectAP1Menu(true);
	if (dir == 0)
	{
		if (sysmenu_wifi_selected_ap_index == 0)
		{
			sysmenu_wifi_needupdate_ap = true;
			dma_memset((void *)WIFI_FoundedAP, 0, sizeof(WIFI_FoundedAP));
			LCD_UpdateQuery.SystemMenuRedraw = true;
		}
		else
		{
			strcpy(TRX.WIFI_AP1, (char *)&WIFI_FoundedAP[sysmenu_wifi_selected_ap_index - 1]);
			WIFI_State = WIFI_CONFIGURED;
			sysmenu_wifi_selectap1_menu_opened = false;
			systemMenuIndex = 0;
			LCD_UpdateQuery.SystemMenuRedraw = true;
		}
	}
}

static void SYSMENU_WIFI_SelectAP2MenuMove(int8_t dir)
{
	if (dir < 0 && sysmenu_wifi_selected_ap_index > 0)
		sysmenu_wifi_selected_ap_index--;
	if (dir > 0 && sysmenu_wifi_selected_ap_index < WIFI_FOUNDED_AP_MAXCOUNT)
		sysmenu_wifi_selected_ap_index++;
	SYSMENU_WIFI_DrawSelectAP2Menu(true);
	if (dir == 0)
	{
		if (sysmenu_wifi_selected_ap_index == 0)
		{
			sysmenu_wifi_needupdate_ap = true;
			dma_memset((void *)WIFI_FoundedAP, 0, sizeof(WIFI_FoundedAP));
			LCD_UpdateQuery.SystemMenuRedraw = true;
		}
		else
		{
			strcpy(TRX.WIFI_AP2, (char *)&WIFI_FoundedAP[sysmenu_wifi_selected_ap_index - 1]);
			WIFI_State = WIFI_CONFIGURED;
			sysmenu_wifi_selectap2_menu_opened = false;
			systemMenuIndex = 0;
			LCD_UpdateQuery.SystemMenuRedraw = true;
		}
	}
}

static void SYSMENU_WIFI_SelectAP3MenuMove(int8_t dir)
{
	if (dir < 0 && sysmenu_wifi_selected_ap_index > 0)
		sysmenu_wifi_selected_ap_index--;
	if (dir > 0 && sysmenu_wifi_selected_ap_index < WIFI_FOUNDED_AP_MAXCOUNT)
		sysmenu_wifi_selected_ap_index++;
	SYSMENU_WIFI_DrawSelectAP3Menu(true);
	if (dir == 0)
	{
		if (sysmenu_wifi_selected_ap_index == 0)
		{
			sysmenu_wifi_needupdate_ap = true;
			dma_memset((void *)WIFI_FoundedAP, 0, sizeof(WIFI_FoundedAP));
			LCD_UpdateQuery.SystemMenuRedraw = true;
		}
		else
		{
			strcpy(TRX.WIFI_AP3, (char *)&WIFI_FoundedAP[sysmenu_wifi_selected_ap_index - 1]);
			WIFI_State = WIFI_CONFIGURED;
			sysmenu_wifi_selectap3_menu_opened = false;
			systemMenuIndex = 0;
			LCD_UpdateQuery.SystemMenuRedraw = true;
		}
	}
}

