witalis3/UA3REO-DDC-Transceiver/STM32/Src/system_menu.c
static void SYSMENU_HANDL_CALIB_ENCODER_SLOW_RATE(int8_t direction)
{
	CALIBRATE.ENCODER_SLOW_RATE += direction;
	if (CALIBRATE.ENCODER_SLOW_RATE < 1)
		CALIBRATE.ENCODER_SLOW_RATE = 1;
	if (CALIBRATE.ENCODER_SLOW_RATE > 100)
		CALIBRATE.ENCODER_SLOW_RATE = 100;
}

static void SYSMENU_HANDL_CALIB_ENCODER_ON_FALLING(int8_t direction)
{
	if (direction > 0)
		CALIBRATE.ENCODER_ON_FALLING = true;
	if (direction < 0)
		CALIBRATE.ENCODER_ON_FALLING = false;
}

static void SYSMENU_HANDL_CALIB_ENCODER_ACCELERATION(int8_t direction)
{
	CALIBRATE.ENCODER_ACCELERATION += direction;
	if (CALIBRATE.ENCODER_ACCELERATION < 1)
		CALIBRATE.ENCODER_ACCELERATION = 1;
	if (CALIBRATE.ENCODER_ACCELERATION > 250)
		CALIBRATE.ENCODER_ACCELERATION = 250;
}

static void SYSMENU_HANDL_CALIBRATIONMENU(int8_t direction)
{
#pragma unused(direction)
	if (!SYSMENU_hiddenmenu_enabled)
		return;
	sysmenu_handlers_selected = (struct sysmenu_item_handler *)&sysmenu_calibration_handlers[0];
	sysmenu_item_count_selected = (uint8_t *)&sysmenu_calibration_item_count;
	sysmenu_onroot = false;
	systemMenuIndex = 0;
	LCD_UpdateQuery.SystemMenuRedraw = true;
}

static void SYSMENU_HANDL_SWR_Tandem_Ctrl(int8_t direction) //Tisho
{
#pragma unused(direction)
	if (SYSMENU_TDM_CTRL_opened)
	{
	}
	else
	{
		SYSMENU_TDM_CTRL_opened = true;
		TDM_Voltages_Start();
		//		drawSystemMenu(true);
	}
}

static void SYSMENU_HANDL_CALIB_CICCOMP_48K_SHIFT(int8_t direction)
{
	CALIBRATE.CICFIR_GAINER_48K_val += direction;
	if (CALIBRATE.CICFIR_GAINER_48K_val < 32)
		CALIBRATE.CICFIR_GAINER_48K_val = 32;
	if (CALIBRATE.CICFIR_GAINER_48K_val > 61)
		CALIBRATE.CICFIR_GAINER_48K_val = 61;
}

static void SYSMENU_HANDL_CALIB_CICCOMP_96K_SHIFT(int8_t direction)
{
	CALIBRATE.CICFIR_GAINER_96K_val += direction;
	if (CALIBRATE.CICFIR_GAINER_96K_val < 32)
		CALIBRATE.CICFIR_GAINER_96K_val = 32;
	if (CALIBRATE.CICFIR_GAINER_96K_val > 61)
		CALIBRATE.CICFIR_GAINER_96K_val = 61;
}

static void SYSMENU_HANDL_CALIB_CICCOMP_192K_SHIFT(int8_t direction)
{
	CALIBRATE.CICFIR_GAINER_192K_val += direction;
	if (CALIBRATE.CICFIR_GAINER_192K_val < 32)
		CALIBRATE.CICFIR_GAINER_192K_val = 32;
	if (CALIBRATE.CICFIR_GAINER_192K_val > 61)
		CALIBRATE.CICFIR_GAINER_192K_val = 61;
}

static void SYSMENU_HANDL_CALIB_CICCOMP_384K_SHIFT(int8_t direction)
{
	CALIBRATE.CICFIR_GAINER_384K_val += direction;
	if (CALIBRATE.CICFIR_GAINER_384K_val < 32)
		CALIBRATE.CICFIR_GAINER_384K_val = 32;
	if (CALIBRATE.CICFIR_GAINER_384K_val > 61)
		CALIBRATE.CICFIR_GAINER_384K_val = 61;
}

static void SYSMENU_HANDL_CALIB_TXCICCOMP_SHIFT(int8_t direction)
{
	CALIBRATE.TXCICFIR_GAINER_val += direction;
	if (CALIBRATE.TXCICFIR_GAINER_val < 16)
		CALIBRATE.TXCICFIR_GAINER_val = 16;
	if (CALIBRATE.TXCICFIR_GAINER_val > 48)
		CALIBRATE.TXCICFIR_GAINER_val = 48;
}

static void SYSMENU_HANDL_CALIB_DAC_SHIFT(int8_t direction)
{
	CALIBRATE.DAC_GAINER_val += direction;
	if (CALIBRATE.DAC_GAINER_val < 14)
		CALIBRATE.DAC_GAINER_val = 14;
	if (CALIBRATE.DAC_GAINER_val > 28)
		CALIBRATE.DAC_GAINER_val = 28;
}

static void SYSMENU_HANDL_CALIB_RF_GAIN_2200M(int8_t direction)
{
	if (CALIBRATE.rf_out_power_2200m > 0)
		CALIBRATE.rf_out_power_2200m += direction;
	if (CALIBRATE.rf_out_power_2200m == 0 && direction > 0)
		CALIBRATE.rf_out_power_2200m += direction;
	if (CALIBRATE.rf_out_power_2200m > 100)
		CALIBRATE.rf_out_power_2200m = 100;

	TRX_MAX_TX_Amplitude = getMaxTXAmplitudeOnFreq(CurrentVFO()->Freq);
}

static void SYSMENU_HANDL_CALIB_RF_GAIN_160M(int8_t direction)
{
	if (CALIBRATE.rf_out_power_160m > 0)
		CALIBRATE.rf_out_power_160m += direction;
	if (CALIBRATE.rf_out_power_160m == 0 && direction > 0)
		CALIBRATE.rf_out_power_160m += direction;
	if (CALIBRATE.rf_out_power_160m > 100)
		CALIBRATE.rf_out_power_160m = 100;

	TRX_MAX_TX_Amplitude = getMaxTXAmplitudeOnFreq(CurrentVFO()->Freq);
}

static void SYSMENU_HANDL_CALIB_RF_GAIN_80M(int8_t direction)
{
	if (CALIBRATE.rf_out_power_80m > 0)
		CALIBRATE.rf_out_power_80m += direction;
	if (CALIBRATE.rf_out_power_80m == 0 && direction > 0)
		CALIBRATE.rf_out_power_80m += direction;
	if (CALIBRATE.rf_out_power_80m > 100)
		CALIBRATE.rf_out_power_80m = 100;

	TRX_MAX_TX_Amplitude = getMaxTXAmplitudeOnFreq(CurrentVFO()->Freq);
}

static void SYSMENU_HANDL_CALIB_RF_GAIN_40M(int8_t direction)
{
	if (CALIBRATE.rf_out_power_40m > 0)
		CALIBRATE.rf_out_power_40m += direction;
	if (CALIBRATE.rf_out_power_40m == 0 && direction > 0)
		CALIBRATE.rf_out_power_40m += direction;
	if (CALIBRATE.rf_out_power_40m > 100)
		CALIBRATE.rf_out_power_40m = 100;

	TRX_MAX_TX_Amplitude = getMaxTXAmplitudeOnFreq(CurrentVFO()->Freq);
}

static void SYSMENU_HANDL_CALIB_RF_GAIN_30M(int8_t direction)
{
	if (CALIBRATE.rf_out_power_30m > 0)
		CALIBRATE.rf_out_power_30m += direction;
	if (CALIBRATE.rf_out_power_30m == 0 && direction > 0)
		CALIBRATE.rf_out_power_30m += direction;
	if (CALIBRATE.rf_out_power_30m > 100)
		CALIBRATE.rf_out_power_30m = 100;

	TRX_MAX_TX_Amplitude = getMaxTXAmplitudeOnFreq(CurrentVFO()->Freq);
}

static void SYSMENU_HANDL_CALIB_RF_GAIN_20M(int8_t direction)
{
	if (CALIBRATE.rf_out_power_20m > 0)
		CALIBRATE.rf_out_power_20m += direction;
	if (CALIBRATE.rf_out_power_20m == 0 && direction > 0)
		CALIBRATE.rf_out_power_20m += direction;
	if (CALIBRATE.rf_out_power_20m > 100)
		CALIBRATE.rf_out_power_20m = 100;

	TRX_MAX_TX_Amplitude = getMaxTXAmplitudeOnFreq(CurrentVFO()->Freq);
}

static void SYSMENU_HANDL_CALIB_RF_GAIN_17M(int8_t direction)
{
	if (CALIBRATE.rf_out_power_17m > 0)
		CALIBRATE.rf_out_power_17m += direction;
	if (CALIBRATE.rf_out_power_17m == 0 && direction > 0)
		CALIBRATE.rf_out_power_17m += direction;
	if (CALIBRATE.rf_out_power_17m > 100)
		CALIBRATE.rf_out_power_17m = 100;

	TRX_MAX_TX_Amplitude = getMaxTXAmplitudeOnFreq(CurrentVFO()->Freq);
}

static void SYSMENU_HANDL_CALIB_RF_GAIN_15M(int8_t direction)
{
	if (CALIBRATE.rf_out_power_15m > 0)
		CALIBRATE.rf_out_power_15m += direction;
	if (CALIBRATE.rf_out_power_15m == 0 && direction > 0)
		CALIBRATE.rf_out_power_15m += direction;
	if (CALIBRATE.rf_out_power_15m > 100)
		CALIBRATE.rf_out_power_15m = 100;

	TRX_MAX_TX_Amplitude = getMaxTXAmplitudeOnFreq(CurrentVFO()->Freq);
}

static void SYSMENU_HANDL_CALIB_RF_GAIN_12M(int8_t direction)
{
	if (CALIBRATE.rf_out_power_12m > 0)
		CALIBRATE.rf_out_power_12m += direction;
	if (CALIBRATE.rf_out_power_12m == 0 && direction > 0)
		CALIBRATE.rf_out_power_12m += direction;
	if (CALIBRATE.rf_out_power_12m > 100)
		CALIBRATE.rf_out_power_12m = 100;

	TRX_MAX_TX_Amplitude = getMaxTXAmplitudeOnFreq(CurrentVFO()->Freq);
}

static void SYSMENU_HANDL_CALIB_RF_GAIN_10M(int8_t direction)
{
	if (CALIBRATE.rf_out_power_10m > 0)
		CALIBRATE.rf_out_power_10m += direction;
	if (CALIBRATE.rf_out_power_10m == 0 && direction > 0)
		CALIBRATE.rf_out_power_10m += direction;
	if (CALIBRATE.rf_out_power_10m > 100)
		CALIBRATE.rf_out_power_10m = 100;

	TRX_MAX_TX_Amplitude = getMaxTXAmplitudeOnFreq(CurrentVFO()->Freq);
}

