witalis3/UA3REO-DDC-Transceiver/STM32/Src/system_menu.c
static void SYSMENU_HANDL_CALIB_RF_GAIN_6M(int8_t direction)
{
	if (CALIBRATE.rf_out_power_6m > 0)
		CALIBRATE.rf_out_power_6m += direction;
	if (CALIBRATE.rf_out_power_6m == 0 && direction > 0)
		CALIBRATE.rf_out_power_6m += direction;
	if (CALIBRATE.rf_out_power_6m > 100)
		CALIBRATE.rf_out_power_6m = 100;

	TRX_MAX_TX_Amplitude = getMaxTXAmplitudeOnFreq(CurrentVFO()->Freq);
}

static void SYSMENU_HANDL_CALIB_RF_GAIN_2M(int8_t direction)
{
	if (CALIBRATE.rf_out_power_2m > 0)
		CALIBRATE.rf_out_power_2m += direction;
	if (CALIBRATE.rf_out_power_2m == 0 && direction > 0)
		CALIBRATE.rf_out_power_2m += direction;
	if (CALIBRATE.rf_out_power_2m > 100)
		CALIBRATE.rf_out_power_2m = 100;

	TRX_MAX_TX_Amplitude = getMaxTXAmplitudeOnFreq(CurrentVFO()->Freq);
}

static void SYSMENU_HANDL_CALIB_S_METER(int8_t direction)
{
	CALIBRATE.smeter_calibration += direction;
	if (CALIBRATE.smeter_calibration < -50)
		CALIBRATE.smeter_calibration = -50;
	if (CALIBRATE.smeter_calibration > 50)
		CALIBRATE.smeter_calibration = 50;
}

static void SYSMENU_HANDL_CALIB_ADC_OFFSET(int8_t direction)
{
	CALIBRATE.adc_offset += direction;
	if (CALIBRATE.adc_offset < -500)
		CALIBRATE.adc_offset = -500;
	if (CALIBRATE.adc_offset > 500)
		CALIBRATE.adc_offset = 500;
}

static void SYSMENU_HANDL_CALIB_LPF_END(int8_t direction)
{
	CALIBRATE.LPF_END += direction * 100000;
	if (CALIBRATE.LPF_END < 1)
		CALIBRATE.LPF_END = 1;
	if (CALIBRATE.LPF_END > 999999999)
		CALIBRATE.LPF_END = 999999999;
}

static void SYSMENU_HANDL_CALIB_BPF_0_START(int8_t direction)
{
	CALIBRATE.BPF_0_START += direction * 100000;
	if (CALIBRATE.BPF_0_START < 1)
		CALIBRATE.BPF_0_START = 1;
	if (CALIBRATE.BPF_0_START > 999999999)
		CALIBRATE.BPF_0_START = 999999999;
}

static void SYSMENU_HANDL_CALIB_BPF_0_END(int8_t direction)
{
	CALIBRATE.BPF_0_END += direction * 100000;
	if (CALIBRATE.BPF_0_END < 1)
		CALIBRATE.BPF_0_END = 1;
	if (CALIBRATE.BPF_0_END > 999999999)
		CALIBRATE.BPF_0_END = 999999999;
}

static void SYSMENU_HANDL_CALIB_BPF_1_START(int8_t direction)
{
	CALIBRATE.BPF_1_START += direction * 100000;
	if (CALIBRATE.BPF_1_START < 1)
		CALIBRATE.BPF_1_START = 1;
	if (CALIBRATE.BPF_1_START > 999999999)
		CALIBRATE.BPF_1_START = 999999999;
}

static void SYSMENU_HANDL_CALIB_BPF_1_END(int8_t direction)
{
	CALIBRATE.BPF_1_END += direction * 100000;
	if (CALIBRATE.BPF_1_END < 1)
		CALIBRATE.BPF_1_END = 1;
	if (CALIBRATE.BPF_1_END > 999999999)
		CALIBRATE.BPF_1_END = 999999999;
}

static void SYSMENU_HANDL_CALIB_BPF_2_START(int8_t direction)
{
	CALIBRATE.BPF_2_START += direction * 100000;
	if (CALIBRATE.BPF_2_START < 1)
		CALIBRATE.BPF_2_START = 1;
	if (CALIBRATE.BPF_2_START > 999999999)
		CALIBRATE.BPF_2_START = 999999999;
}

static void SYSMENU_HANDL_CALIB_BPF_2_END(int8_t direction)
{
	CALIBRATE.BPF_2_END += direction * 100000;
	if (CALIBRATE.BPF_2_END < 1)
		CALIBRATE.BPF_2_END = 1;
	if (CALIBRATE.BPF_2_END > 999999999)
		CALIBRATE.BPF_2_END = 999999999;
}

static void SYSMENU_HANDL_CALIB_BPF_3_START(int8_t direction)
{
	CALIBRATE.BPF_3_START += direction * 100000;
	if (CALIBRATE.BPF_3_START < 1)
		CALIBRATE.BPF_3_START = 1;
	if (CALIBRATE.BPF_3_START > 999999999)
		CALIBRATE.BPF_3_START = 999999999;
}

static void SYSMENU_HANDL_CALIB_BPF_3_END(int8_t direction)
{
	CALIBRATE.BPF_3_END += direction * 100000;
	if (CALIBRATE.BPF_3_END < 1)
		CALIBRATE.BPF_3_END = 1;
	if (CALIBRATE.BPF_3_END > 999999999)
		CALIBRATE.BPF_3_END = 999999999;
}

static void SYSMENU_HANDL_CALIB_BPF_4_START(int8_t direction)
{
	CALIBRATE.BPF_4_START += direction * 100000;
	if (CALIBRATE.BPF_4_START < 1)
		CALIBRATE.BPF_4_START = 1;
	if (CALIBRATE.BPF_4_START > 999999999)
		CALIBRATE.BPF_4_START = 999999999;
}

static void SYSMENU_HANDL_CALIB_BPF_4_END(int8_t direction)
{
	CALIBRATE.BPF_4_END += direction * 100000;
	if (CALIBRATE.BPF_4_END < 1)
		CALIBRATE.BPF_4_END = 1;
	if (CALIBRATE.BPF_4_END > 999999999)
		CALIBRATE.BPF_4_END = 999999999;
}

static void SYSMENU_HANDL_CALIB_BPF_5_START(int8_t direction)
{
	CALIBRATE.BPF_5_START += direction * 100000;
	if (CALIBRATE.BPF_5_START < 1)
		CALIBRATE.BPF_5_START = 1;
	if (CALIBRATE.BPF_5_START > 999999999)
		CALIBRATE.BPF_5_START = 999999999;
}

static void SYSMENU_HANDL_CALIB_BPF_5_END(int8_t direction)
{
	CALIBRATE.BPF_5_END += direction * 100000;
	if (CALIBRATE.BPF_5_END < 1)
		CALIBRATE.BPF_5_END = 1;
	if (CALIBRATE.BPF_5_END > 999999999)
		CALIBRATE.BPF_5_END = 999999999;
}

static void SYSMENU_HANDL_CALIB_BPF_6_START(int8_t direction)
{
	CALIBRATE.BPF_6_START += direction * 100000;
	if (CALIBRATE.BPF_6_START < 1)
		CALIBRATE.BPF_6_START = 1;
	if (CALIBRATE.BPF_6_START > 999999999)
		CALIBRATE.BPF_6_START = 999999999;
}

static void SYSMENU_HANDL_CALIB_BPF_6_END(int8_t direction)
{
	CALIBRATE.BPF_6_END += direction * 100000;
	if (CALIBRATE.BPF_6_END < 1)
		CALIBRATE.BPF_6_END = 1;
	if (CALIBRATE.BPF_6_END > 999999999)
		CALIBRATE.BPF_6_END = 999999999;
}

static void SYSMENU_HANDL_CALIB_HPF_START(int8_t direction)
{
	CALIBRATE.BPF_HPF += direction * 100000;
	if (CALIBRATE.BPF_HPF < 1)
		CALIBRATE.BPF_HPF = 1;
	if (CALIBRATE.BPF_HPF > 999999999)
		CALIBRATE.BPF_HPF = 999999999;
}

static void SYSMENU_HANDL_CALIB_SWR_FWD_RATE(int8_t direction)
{
	CALIBRATE.SWR_FWD_Calibration += (float32_t)direction * 0.1f;
	if (CALIBRATE.SWR_FWD_Calibration < 1.0f)
		CALIBRATE.SWR_FWD_Calibration = 1.0f;
	if (CALIBRATE.SWR_FWD_Calibration > 50.0f)
		CALIBRATE.SWR_FWD_Calibration = 50.0f;
}

static void SYSMENU_HANDL_CALIB_SWR_REF_RATE(int8_t direction)
{
	CALIBRATE.SWR_REF_Calibration += (float32_t)direction * 0.1f;
	if (CALIBRATE.SWR_REF_Calibration < 1.0f)
		CALIBRATE.SWR_REF_Calibration = 1.0f;
	if (CALIBRATE.SWR_REF_Calibration > 50.0f)
		CALIBRATE.SWR_REF_Calibration = 50.0f;
}

static void SYSMENU_HANDL_CALIB_VCXO(int8_t direction)
{
	CALIBRATE.VCXO_correction += direction;
	if (CALIBRATE.VCXO_correction < -100)
		CALIBRATE.VCXO_correction = -100;
	if (CALIBRATE.VCXO_correction > 100)
		CALIBRATE.VCXO_correction = 100;
}
//Tisho
static void SYSMENU_HANDL_CALIB_FW_AD8307_SLP(int8_t direction)
{
	CALIBRATE.FW_AD8307_SLP += (float32_t)direction * 0.1f;
	if (CALIBRATE.FW_AD8307_SLP < 20.0f)
		CALIBRATE.FW_AD8307_SLP = 20.0f;
	if (CALIBRATE.FW_AD8307_SLP > 30.0f)
		CALIBRATE.FW_AD8307_SLP = 30.0f;
}

