witalis3/UA3REO-DDC-Transceiver/STM32/Src/system_menu.c
static void SYSMENU_HANDL_CALIB_FW_AD8307_OFFS(int8_t direction)
{
	CALIBRATE.FW_AD8307_OFFS += (float32_t)direction;
	if (CALIBRATE.FW_AD8307_OFFS < 0.1f)
		CALIBRATE.FW_AD8307_OFFS = 0.1f;
	if (CALIBRATE.FW_AD8307_OFFS > 4000.0f)
		CALIBRATE.FW_AD8307_OFFS = 4000.0f;
}

static void SYSMENU_HANDL_CALIB_BW_AD8307_SLP(int8_t direction)
{
	CALIBRATE.BW_AD8307_SLP += (float32_t)direction * 0.1f;
	if (CALIBRATE.BW_AD8307_SLP < 20.0f)
		CALIBRATE.BW_AD8307_SLP = 20.0f;
	if (CALIBRATE.BW_AD8307_SLP > 30.0f)
		CALIBRATE.BW_AD8307_SLP = 30.0f;
}

static void SYSMENU_HANDL_CALIB_BW_AD8307_OFFS(int8_t direction)
{
	CALIBRATE.BW_AD8307_OFFS += (float32_t)direction;
	if (CALIBRATE.BW_AD8307_OFFS < 0.1f)
		CALIBRATE.BW_AD8307_OFFS = 0.1f;
	if (CALIBRATE.BW_AD8307_OFFS > 4000.0f)
		CALIBRATE.BW_AD8307_OFFS = 4000.0f;
}
//end Tisho
static void SYSMENU_HANDL_CALIB_FAN_MEDIUM_START(int8_t direction)
{
	CALIBRATE.FAN_MEDIUM_START += direction;
	if (CALIBRATE.FAN_MEDIUM_START < 10)
		CALIBRATE.FAN_MEDIUM_START = 10;
	if (CALIBRATE.FAN_MEDIUM_START > 100)
		CALIBRATE.FAN_MEDIUM_START = 100;
}

static void SYSMENU_HANDL_CALIB_FAN_MEDIUM_STOP(int8_t direction)
{
	CALIBRATE.FAN_MEDIUM_STOP += direction;
	if (CALIBRATE.FAN_MEDIUM_STOP < 10)
		CALIBRATE.FAN_MEDIUM_STOP = 10;
	if (CALIBRATE.FAN_MEDIUM_STOP > (CALIBRATE.FAN_MEDIUM_START - 1))
		CALIBRATE.FAN_MEDIUM_STOP = CALIBRATE.FAN_MEDIUM_START - 1;
}

static void SYSMENU_HANDL_CALIB_FAN_FULL_START(int8_t direction)
{
	CALIBRATE.FAN_FULL_START += direction;
	if (CALIBRATE.FAN_FULL_START < 10)
		CALIBRATE.FAN_FULL_START = 10;
	if (CALIBRATE.FAN_FULL_START > 100)
		CALIBRATE.FAN_FULL_START = 100;
}

static void SYSMENU_HANDL_CALIB_TRX_MAX_RF_TEMP(int8_t direction)
{
	CALIBRATE.TRX_MAX_RF_TEMP += direction;
	if (CALIBRATE.TRX_MAX_RF_TEMP < 30)
		CALIBRATE.TRX_MAX_RF_TEMP = 30;
	if (CALIBRATE.TRX_MAX_RF_TEMP > 120)
		CALIBRATE.TRX_MAX_RF_TEMP = 120;
}

static void SYSMENU_HANDL_CALIB_TRX_MAX_SWR(int8_t direction)
{
	CALIBRATE.TRX_MAX_SWR += direction;
	if (CALIBRATE.TRX_MAX_SWR < 2)
		CALIBRATE.TRX_MAX_SWR = 2;
	if (CALIBRATE.TRX_MAX_SWR > 50)
		CALIBRATE.TRX_MAX_SWR = 50;
}

static void SYSMENU_HANDL_CALIB_FM_DEVIATION_SCALE(int8_t direction)
{
	CALIBRATE.FM_DEVIATION_SCALE += direction;
	if (CALIBRATE.FM_DEVIATION_SCALE < 1)
		CALIBRATE.FM_DEVIATION_SCALE = 1;
	if (CALIBRATE.FM_DEVIATION_SCALE > 20)
		CALIBRATE.FM_DEVIATION_SCALE = 20;
}

static void SYSMENU_HANDL_CALIB_TUNE_MAX_POWER(int8_t direction)
{
	CALIBRATE.TUNE_MAX_POWER += direction;
	if (CALIBRATE.TUNE_MAX_POWER < 1)
		CALIBRATE.TUNE_MAX_POWER = 1;
	if (CALIBRATE.TUNE_MAX_POWER > 20)
		CALIBRATE.TUNE_MAX_POWER = 20;
}

static void SYSMENU_HANDL_CALIB_RTC_CALIBRATION(int8_t direction)
{
	CALIBRATE.RTC_Calibration += direction;
	if (CALIBRATE.RTC_Calibration < -511)
		CALIBRATE.RTC_Calibration = -511;
	if (CALIBRATE.RTC_Calibration > 511)
		CALIBRATE.RTC_Calibration = 511;

	RTC_Calibration();
}

static void SYSMENU_HANDL_CALIB_RTC_COARSE_CALIBRATION(int8_t direction)
{
	CALIBRATE.RTC_Coarse_Calibration += direction;
	if (CALIBRATE.RTC_Coarse_Calibration < 1)
		CALIBRATE.RTC_Coarse_Calibration = 1;
	if (CALIBRATE.RTC_Coarse_Calibration > 250)
		CALIBRATE.RTC_Coarse_Calibration = 250;

	RTC_Calibration();
}

//SERVICES
void SYSMENU_HANDL_SERVICESMENU(int8_t direction)
{
#pragma unused(direction)
	sysmenu_services_opened = true;
	sysmenu_handlers_selected = (struct sysmenu_item_handler *)&sysmenu_services_handlers[0];
	sysmenu_item_count_selected = (uint8_t *)&sysmenu_services_item_count;
	sysmenu_onroot = false;
	systemMenuIndex = 0;
	//drawSystemMenu(true);
	LCD_redraw(false);
}

//SPECTRUM ANALIZER
static void SYSMENU_HANDL_SPECTRUMMENU(int8_t direction)
{
#pragma unused(direction)
	sysmenu_handlers_selected = (struct sysmenu_item_handler *)&sysmenu_spectrum_handlers[0];
	sysmenu_item_count_selected = (uint8_t *)&sysmenu_spectrum_item_count;
	sysmenu_onroot = false;
	systemMenuIndex = 0;
	LCD_UpdateQuery.SystemMenuRedraw = true;
}

static void SYSMENU_HANDL_SPECTRUM_Start(int8_t direction)
{
	if (SYSMENU_spectrum_opened)
	{
		SPEC_EncRotate(direction);
	}
	else
	{
		SYSMENU_spectrum_opened = true;
		SPEC_Start();
		LCD_UpdateQuery.SystemMenuRedraw = true;
	}
}

static void SYSMENU_HANDL_SPECTRUM_Begin(int8_t direction)
{
	TRX.SPEC_Begin += direction * 100;
	if (TRX.SPEC_Begin < 100)
		TRX.SPEC_Begin = 100;
}

static void SYSMENU_HANDL_SPECTRUM_End(int8_t direction)
{
	TRX.SPEC_End += direction * 100;
	if (TRX.SPEC_End < 100)
		TRX.SPEC_End = 100;
}

static void SYSMENU_HANDL_SPECTRUM_TopDBM(int8_t direction)
{
	TRX.SPEC_TopDBM += direction;
	if (TRX.SPEC_TopDBM < -140)
		TRX.SPEC_TopDBM = -140;
	if (TRX.SPEC_TopDBM > 40)
		TRX.SPEC_TopDBM = 40;
	if (TRX.SPEC_TopDBM <= TRX.SPEC_BottomDBM)
		TRX.SPEC_TopDBM = TRX.SPEC_BottomDBM + 1;
}

static void SYSMENU_HANDL_SPECTRUM_BottomDBM(int8_t direction)
{
	TRX.SPEC_BottomDBM += direction;
	if (TRX.SPEC_BottomDBM < -140)
		TRX.SPEC_BottomDBM = -140;
	if (TRX.SPEC_BottomDBM > 40)
		TRX.SPEC_BottomDBM = 40;
	if (TRX.SPEC_BottomDBM >= TRX.SPEC_TopDBM)
		TRX.SPEC_BottomDBM = TRX.SPEC_TopDBM - 1;
}

//WSPR Beacon
static void SYSMENU_HANDL_WSPRMENU(int8_t direction)
{
#pragma unused(direction)
	sysmenu_handlers_selected = (struct sysmenu_item_handler *)&sysmenu_wspr_handlers[0];
	sysmenu_item_count_selected = (uint8_t *)&sysmenu_wspr_item_count;
	sysmenu_onroot = false;
	systemMenuIndex = 0;
	LCD_UpdateQuery.SystemMenuRedraw = true;
}

static void SYSMENU_HANDL_WSPR_Start(int8_t direction)
{
	if (SYSMENU_wspr_opened)
	{
		WSPR_EncRotate(direction);
	}
	else
	{
		SYSMENU_wspr_opened = true;
		WSPR_Start();
		LCD_UpdateQuery.SystemMenuRedraw = true;
	}
}

static void SYSMENU_HANDL_WSPR_FREQ_OFFSET(int8_t direction)
{
	TRX.WSPR_FREQ_OFFSET += direction;
	if (TRX.WSPR_FREQ_OFFSET < -2000)
		TRX.WSPR_FREQ_OFFSET = -2000;
	if (TRX.WSPR_FREQ_OFFSET > 2000)
		TRX.WSPR_FREQ_OFFSET = 2000;
}

static void SYSMENU_HANDL_WSPR_BAND160(int8_t direction)
{
	if (direction > 0)
		TRX.WSPR_BANDS_160 = true;
	if (direction < 0)
		TRX.WSPR_BANDS_160 = false;
}

