witalis3/UA3REO-DDC-Transceiver/STM32/Src/system_menu.c
static void SYSMENU_HANDL_WSPR_BAND80(int8_t direction)
{
	if (direction > 0)
		TRX.WSPR_BANDS_80 = true;
	if (direction < 0)
		TRX.WSPR_BANDS_80 = false;
}

static void SYSMENU_HANDL_WSPR_BAND40(int8_t direction)
{
	if (direction > 0)
		TRX.WSPR_BANDS_40 = true;
	if (direction < 0)
		TRX.WSPR_BANDS_40 = false;
}

static void SYSMENU_HANDL_WSPR_BAND30(int8_t direction)
{
	if (direction > 0)
		TRX.WSPR_BANDS_30 = true;
	if (direction < 0)
		TRX.WSPR_BANDS_30 = false;
}

static void SYSMENU_HANDL_WSPR_BAND20(int8_t direction)
{
	if (direction > 0)
		TRX.WSPR_BANDS_20 = true;
	if (direction < 0)
		TRX.WSPR_BANDS_20 = false;
}

static void SYSMENU_HANDL_WSPR_BAND17(int8_t direction)
{
	if (direction > 0)
		TRX.WSPR_BANDS_17 = true;
	if (direction < 0)
		TRX.WSPR_BANDS_17 = false;
}

static void SYSMENU_HANDL_WSPR_BAND15(int8_t direction)
{
	if (direction > 0)
		TRX.WSPR_BANDS_15 = true;
	if (direction < 0)
		TRX.WSPR_BANDS_15 = false;
}

static void SYSMENU_HANDL_WSPR_BAND12(int8_t direction)
{
	if (direction > 0)
		TRX.WSPR_BANDS_12 = true;
	if (direction < 0)
		TRX.WSPR_BANDS_12 = false;
}

static void SYSMENU_HANDL_WSPR_BAND10(int8_t direction)
{
	if (direction > 0)
		TRX.WSPR_BANDS_10 = true;
	if (direction < 0)
		TRX.WSPR_BANDS_10 = false;
}

static void SYSMENU_HANDL_WSPR_BAND6(int8_t direction)
{
	if (direction > 0)
		TRX.WSPR_BANDS_6 = true;
	if (direction < 0)
		TRX.WSPR_BANDS_6 = false;
}

static void SYSMENU_HANDL_WSPR_BAND2(int8_t direction)
{
	if (direction > 0)
		TRX.WSPR_BANDS_2 = true;
	if (direction < 0)
		TRX.WSPR_BANDS_2 = false;
}

//SWR BAND ANALYZER
static void SYSMENU_HANDL_SWR_BAND_START(int8_t direction)
{
	if (SYSMENU_swr_opened)
	{
		SWR_EncRotate(direction);
	}
	else
	{
		SYSMENU_swr_opened = true;
		int8_t band = getBandFromFreq(CurrentVFO()->Freq, true);
		SWR_Start(BANDS[band].startFreq - 100000, BANDS[band].endFreq + 100000);
		LCD_UpdateQuery.SystemMenuRedraw = true;
	}
}

//SWR HF ANALYZER
static void SYSMENU_HANDL_SWR_HF_START(int8_t direction)
{
	if (SYSMENU_swr_opened)
	{
		SWR_EncRotate(direction);
	}
	else
	{
		SYSMENU_swr_opened = true;
		SWR_Start(1000000, 60000000);
		LCD_UpdateQuery.SystemMenuRedraw = true;
	}
}

//RDA STATS
static void SYSMENU_HANDL_RDA_STATS(int8_t direction)
{
#pragma unused(direction)
	sysmenu_infowindow_opened = true;
	SYSMENU_drawSystemMenu(true);
	WIFI_getRDA();
}

//PROPAGINATION
static void SYSMENU_HANDL_PROPAGINATION(int8_t direction)
{
#pragma unused(direction)
	sysmenu_infowindow_opened = true;
	SYSMENU_drawSystemMenu(true);
	WIFI_getPropagination();
}

//SD FILE MANAGER
static void SYSMENU_HANDL_FILEMANAGER(int8_t direction)
{
#pragma unused(direction)
	sysmenu_filemanager_opened = true;
	SYSMENU_drawSystemMenu(true);
}

//COMMON MENU FUNCTIONS
void SYSMENU_drawSystemMenu(bool draw_background)
{
	if (LCD_busy)
	{
		if (draw_background)
			LCD_UpdateQuery.SystemMenuRedraw = true;
		else
			LCD_UpdateQuery.SystemMenu = true;
		return;
	}
	if (!LCD_systemMenuOpened)
		return;
	if (sysmenu_timeMenuOpened)
	{
		SYSMENU_HANDL_SETTIME(0);
		return;
	}
	else if (sysmenu_wifi_selectap1_menu_opened)
	{
		SYSMENU_WIFI_DrawSelectAP1Menu(draw_background);
	}
	else if (sysmenu_wifi_selectap2_menu_opened)
	{
		SYSMENU_WIFI_DrawSelectAP2Menu(draw_background);
	}
	else if (sysmenu_wifi_selectap3_menu_opened)
	{
		SYSMENU_WIFI_DrawSelectAP3Menu(draw_background);
	}
	else if (sysmenu_wifi_setAP1password_menu_opened)
	{
		SYSMENU_WIFI_DrawAP1passwordMenu(draw_background);
	}
	else if (sysmenu_wifi_setAP2password_menu_opened)
	{
		SYSMENU_WIFI_DrawAP2passwordMenu(draw_background);
	}
	else if (sysmenu_wifi_setAP3password_menu_opened)
	{
		SYSMENU_WIFI_DrawAP3passwordMenu(draw_background);
	}
	else if (sysmenu_trx_setCallsign_menu_opened)
	{
		SYSMENU_TRX_DrawCallsignMenu(draw_background);
	}
	else if (sysmenu_trx_setLocator_menu_opened)
	{
		SYSMENU_TRX_DrawLocatorMenu(draw_background);
	}
	else if (SYSMENU_spectrum_opened)
	{
		SPEC_Draw();
	}
	else if (SYSMENU_wspr_opened)
	{
		WSPR_DoEvents();
		return;
	}
	else if (SYSMENU_TDM_CTRL_opened) //Tisho
	{
		TDM_Voltages();
	}
	else if (SYSMENU_swr_opened)
	{
		SWR_Draw();
	}
	else if (sysmenu_sysinfo_opened)
	{
		SYSMENU_HANDL_SYSINFO(0);
		return;
	}
	else if (sysmenu_filemanager_opened)
	{
		FILEMANAGER_Draw(draw_background);
		return;
	}
	else if (sysmenu_infowindow_opened)
	{
	}
	else
	{
		LCD_busy = true;

		sysmenu_i = 0;
		sysmenu_y = 5;

		if (draw_background)
			LCDDriver_Fill(BG_COLOR);

		uint8_t current_selected_page = systemMenuIndex / LAYOUT->SYSMENU_MAX_ITEMS_ON_PAGE;
		if (current_selected_page * LAYOUT->SYSMENU_MAX_ITEMS_ON_PAGE > *sysmenu_item_count_selected)
			current_selected_page = 0;

		for (uint8_t m = 0; m < *sysmenu_item_count_selected; m++)
		{
			uint8_t current_page = m / LAYOUT->SYSMENU_MAX_ITEMS_ON_PAGE;
			if (current_selected_page == current_page)
				drawSystemMenuElement(sysmenu_handlers_selected[m].title, sysmenu_handlers_selected[m].type, sysmenu_handlers_selected[m].value, sysmenu_handlers_selected[m].enumerate, false);
		}

		LCD_busy = false;
	}

	LCD_UpdateQuery.SystemMenu = false;
	if (draw_background)
		LCD_UpdateQuery.SystemMenuRedraw = false;
}

void SYSMENU_eventRotateSystemMenu(int8_t direction)
{
	if (sysmenu_wifi_selectap1_menu_opened)
	{
		SYSMENU_WIFI_SelectAP1MenuMove(0);
		return;
	}
	if (sysmenu_wifi_selectap2_menu_opened)
	{
		SYSMENU_WIFI_SelectAP2MenuMove(0);
		return;
	}
	if (sysmenu_wifi_selectap3_menu_opened)
	{
		SYSMENU_WIFI_SelectAP3MenuMove(0);
		return;
	}
	if (sysmenu_wifi_setAP1password_menu_opened)
	{
		SYSMENU_WIFI_RotatePasswordChar1(direction);
		return;
	}
	if (sysmenu_wifi_setAP2password_menu_opened)
	{
		SYSMENU_WIFI_RotatePasswordChar2(direction);
		return;
	}
	if (sysmenu_wifi_setAP3password_menu_opened)
	{
		SYSMENU_WIFI_RotatePasswordChar3(direction);
		return;
	}
	if (sysmenu_trx_setCallsign_menu_opened)
	{
		SYSMENU_TRX_RotateCallsignChar(direction);
		return;
	}
	if (sysmenu_trx_setLocator_menu_opened)
	{
		SYSMENU_TRX_RotateLocatorChar(direction);
		return;
	}
	if (sysmenu_timeMenuOpened)
	{
		SYSMENU_HANDL_SETTIME(direction);
		LCD_UpdateQuery.SystemMenu = true;
		return;
	}
	if (sysmenu_filemanager_opened)
	{
		FILEMANAGER_EventRotate(direction);
		return;
	}
	if (sysmenu_handlers_selected[systemMenuIndex].type != SYSMENU_INFOLINE)
		sysmenu_handlers_selected[systemMenuIndex].menuHandler(direction);
	if (sysmenu_handlers_selected[systemMenuIndex].type != SYSMENU_RUN)
		LCD_UpdateQuery.SystemMenuCurrent = true;
}

void SYSMENU_eventCloseSystemMenu(void)
{
	if (sysmenu_wifi_selectap1_menu_opened)
	{
		sysmenu_wifi_selectap1_menu_opened = false;
		systemMenuIndex = 0;
		LCD_UpdateQuery.SystemMenuRedraw = true;
		WIFI_State = WIFI_CONFIGURED;
	}
	if (sysmenu_wifi_selectap2_menu_opened)
	{
		sysmenu_wifi_selectap2_menu_opened = false;
		systemMenuIndex = 0;
		LCD_UpdateQuery.SystemMenuRedraw = true;
		WIFI_State = WIFI_CONFIGURED;
	}
	if (sysmenu_wifi_selectap3_menu_opened)
	{
		sysmenu_wifi_selectap3_menu_opened = false;
		systemMenuIndex = 0;
		LCD_UpdateQuery.SystemMenuRedraw = true;
		WIFI_State = WIFI_CONFIGURED;
	}
	else if (sysmenu_wifi_setAP1password_menu_opened)
	{
		sysmenu_wifi_setAP1password_menu_opened = false;
		systemMenuIndex = 0;
		LCD_UpdateQuery.SystemMenuRedraw = true;
		WIFI_State = WIFI_CONFIGURED;
	}
	else if (sysmenu_wifi_setAP2password_menu_opened)
	{
		sysmenu_wifi_setAP2password_menu_opened = false;
		systemMenuIndex = 0;
		LCD_UpdateQuery.SystemMenuRedraw = true;
		WIFI_State = WIFI_CONFIGURED;
	}
	else if (sysmenu_wifi_setAP3password_menu_opened)
	{
		sysmenu_wifi_setAP3password_menu_opened = false;
		systemMenuIndex = 0;
		LCD_UpdateQuery.SystemMenuRedraw = true;
		WIFI_State = WIFI_CONFIGURED;
	}
	else if (sysmenu_trx_setCallsign_menu_opened)
	{
		sysmenu_trx_setCallsign_menu_opened = false;
		systemMenuIndex = 0;
		LCD_UpdateQuery.SystemMenuRedraw = true;
	}
	else if (sysmenu_trx_setLocator_menu_opened)
	{
		sysmenu_trx_setLocator_menu_opened = false;
		systemMenuIndex = 0;
		LCD_UpdateQuery.SystemMenuRedraw = true;
	}
	else if (SYSMENU_spectrum_opened)
	{
		SYSMENU_spectrum_opened = false;
		SPEC_Stop();
		systemMenuIndex = 0;
		LCD_UpdateQuery.SystemMenuRedraw = true;
	}
	else if (SYSMENU_wspr_opened)
	{
		SYSMENU_wspr_opened = false;
		WSPR_Stop();
		systemMenuIndex = 0;
		LCD_UpdateQuery.SystemMenuRedraw = true;
	}
	else if (sysmenu_timeMenuOpened)
	{
		sysmenu_timeMenuOpened = false;
		systemMenuIndex = 0;
		LCD_UpdateQuery.SystemMenuRedraw = true;
	}
	else if (SYSMENU_swr_opened)
	{
		SYSMENU_swr_opened = false;
		SWR_Stop();
		systemMenuIndex = 0;
		LCD_UpdateQuery.SystemMenuRedraw = true;
	}
	else if (SYSMENU_TDM_CTRL_opened) //Tisho
	{
		SYSMENU_TDM_CTRL_opened = false;
		systemMenuIndex = 0;
		LCD_UpdateQuery.SystemMenuRedraw = true;
	}
	else if (sysmenu_infowindow_opened)
	{
		sysmenu_infowindow_opened = false;
		sysmenu_sysinfo_opened = false;
		systemMenuIndex = 0;
		LCD_UpdateQuery.SystemMenuRedraw = true;
	}
	else if (sysmenu_filemanager_opened)
	{
		FILEMANAGER_Closing();
		sysmenu_filemanager_opened = false;
		systemMenuIndex = 0;
		LCD_UpdateQuery.SystemMenuRedraw = true;
	}
	else if (sysmenu_services_opened)
	{
		sysmenu_handlers_selected = (struct sysmenu_item_handler *)&sysmenu_handlers[0];
		sysmenu_item_count_selected = (uint8_t *)&sysmenu_item_count;
		sysmenu_onroot = true;
		systemMenuIndex = systemMenuRootIndex;
		sysmenu_services_opened = false;
		LCD_systemMenuOpened = false;
		LCD_UpdateQuery.Background = true;
		LCD_redraw(false);
	}
	else
	{
		if (sysmenu_onroot)
		{
			LCD_systemMenuOpened = false;
			LCD_UpdateQuery.Background = true;
			LCD_redraw(false);
		}
		else
		{
			if (sysmenu_handlers_selected == (struct sysmenu_item_handler *)&sysmenu_calibration_handlers[0]) //exit from calibration
				NeedSaveCalibration = true;

			sysmenu_handlers_selected = (struct sysmenu_item_handler *)&sysmenu_handlers[0];
			sysmenu_item_count_selected = (uint8_t *)&sysmenu_item_count;
			sysmenu_onroot = true;
			systemMenuIndex = systemMenuRootIndex;
			SYSMENU_drawSystemMenu(true);
		}
	}
	sysmenu_item_selected_by_enc2 = false;
	NeedSaveSettings = true;

	if (SD_USBCardReader)
	{
		SD_USBCardReader = false;
		USBD_Restart();
		TRX_Mute = false;
	}
}

void SYSMENU_eventCloseAllSystemMenu(void)
{
	sysmenu_handlers_selected = (struct sysmenu_item_handler *)&sysmenu_handlers[0];
	sysmenu_item_count_selected = (uint8_t *)&sysmenu_item_count;
	sysmenu_onroot = true;
	systemMenuIndex = systemMenuRootIndex;
	sysmenu_item_selected_by_enc2 = false;
	LCD_systemMenuOpened = false;
	LCD_UpdateQuery.Background = true;
	LCD_redraw(false);
}

//secondary encoder click
void SYSMENU_eventSecEncoderClickSystemMenu(void)
{
	if (sysmenu_handlers_selected[systemMenuIndex].type == SYSMENU_MENU || sysmenu_handlers_selected[systemMenuIndex].type == SYSMENU_HIDDEN_MENU || sysmenu_handlers_selected[systemMenuIndex].type == SYSMENU_RUN || sysmenu_handlers_selected[systemMenuIndex].type == SYSMENU_INFOLINE)
	{
		sysmenu_item_selected_by_enc2 = false;
		SYSMENU_eventRotateSystemMenu(1);
	}
	else
	{
		sysmenu_item_selected_by_enc2 = !sysmenu_item_selected_by_enc2;
		LCD_UpdateQuery.SystemMenuCurrent = true;
	}
}

//secondary encoder rotate
void SYSMENU_eventSecRotateSystemMenu(int8_t direction)
{
	//wifi select AP menu
	if (sysmenu_wifi_selectap1_menu_opened)
	{
		if (direction < 0)
			SYSMENU_WIFI_SelectAP1MenuMove(-1);
		else
			SYSMENU_WIFI_SelectAP1MenuMove(1);
		return;
	}
	if (sysmenu_wifi_selectap2_menu_opened)
	{
		if (direction < 0)
			SYSMENU_WIFI_SelectAP2MenuMove(-1);
		else
			SYSMENU_WIFI_SelectAP2MenuMove(1);
		return;
	}
	if (sysmenu_wifi_selectap3_menu_opened)
	{
		if (direction < 0)
			SYSMENU_WIFI_SelectAP3MenuMove(-1);
		else
			SYSMENU_WIFI_SelectAP3MenuMove(1);
		return;
	}
	//wifi set password menu
	if (sysmenu_wifi_setAP1password_menu_opened)
	{
		if (direction < 0 && sysmenu_wifi_selected_ap_password_char_index > 0)
		{
			sysmenu_wifi_selected_ap_password_char_index--;
			SYSMENU_WIFI_DrawAP1passwordMenu(true);
		}
		else if (sysmenu_wifi_selected_ap_password_char_index < (MAX_WIFIPASS_LENGTH - 1))
		{
			sysmenu_wifi_selected_ap_password_char_index++;
			SYSMENU_WIFI_DrawAP1passwordMenu(true);
		}
		return;
	}
	if (sysmenu_wifi_setAP2password_menu_opened)
	{
		if (direction < 0 && sysmenu_wifi_selected_ap_password_char_index > 0)
		{
			sysmenu_wifi_selected_ap_password_char_index--;
			SYSMENU_WIFI_DrawAP2passwordMenu(true);
		}
		else if (sysmenu_wifi_selected_ap_password_char_index < (MAX_WIFIPASS_LENGTH - 1))
		{
			sysmenu_wifi_selected_ap_password_char_index++;
			SYSMENU_WIFI_DrawAP2passwordMenu(true);
		}
		return;
	}
	if (sysmenu_wifi_setAP3password_menu_opened)
	{
		if (direction < 0 && sysmenu_wifi_selected_ap_password_char_index > 0)
		{
			sysmenu_wifi_selected_ap_password_char_index--;
			SYSMENU_WIFI_DrawAP3passwordMenu(true);
		}
		else if (sysmenu_wifi_selected_ap_password_char_index < (MAX_WIFIPASS_LENGTH - 1))
		{
			sysmenu_wifi_selected_ap_password_char_index++;
			SYSMENU_WIFI_DrawAP3passwordMenu(true);
		}
		return;
	}
	//Callsign menu
	if (sysmenu_trx_setCallsign_menu_opened)
	{
		if (direction < 0 && sysmenu_trx_selected_callsign_char_index > 0)
		{
			sysmenu_trx_selected_callsign_char_index--;
			SYSMENU_TRX_DrawCallsignMenu(true);
		}
		else if (sysmenu_trx_selected_callsign_char_index < (MAX_CALLSIGN_LENGTH - 1))
		{
			sysmenu_trx_selected_callsign_char_index++;
			SYSMENU_TRX_DrawCallsignMenu(true);
		}
		return;
	}
	//Locator menu
	if (sysmenu_trx_setLocator_menu_opened)
	{
		if (direction < 0 && sysmenu_trx_selected_locator_char_index > 0)
		{
			sysmenu_trx_selected_locator_char_index--;
			SYSMENU_TRX_DrawLocatorMenu(true);
		}
		else if (sysmenu_trx_selected_locator_char_index < (MAX_CALLSIGN_LENGTH - 1))
		{
			sysmenu_trx_selected_locator_char_index++;
			SYSMENU_TRX_DrawLocatorMenu(true);
		}
		return;
	}
	if (SYSMENU_spectrum_opened)
	{
		SPEC_Stop();
		SYSMENU_spectrum_opened = false;
		LCD_UpdateQuery.SystemMenuRedraw = true;
		return;
	}
	if (SYSMENU_wspr_opened)
	{
		WSPR_Stop();
		SYSMENU_wspr_opened = false;
		LCD_UpdateQuery.SystemMenuRedraw = true;
		return;
	}
	if (SYSMENU_swr_opened)
		return;
	if (sysmenu_infowindow_opened)
		return;
	//time menu
	if (sysmenu_timeMenuOpened)
	{
		LCDDriver_Fill(BG_COLOR);
		if (direction < 0)
		{
			TimeMenuSelection--;
			if (TimeMenuSelection > 2)
				TimeMenuSelection = 2;
		}
		else
		{
			TimeMenuSelection++;
			if (TimeMenuSelection == 3)
				TimeMenuSelection = 0;
		}
		LCD_UpdateQuery.SystemMenu = true;
		return;
	}
	//File manager
	if (sysmenu_filemanager_opened)
	{
		FILEMANAGER_EventSecondaryRotate(direction);
		return;
	}
	//other
	if (sysmenu_item_selected_by_enc2) //selected by secondary encoder
	{
		SYSMENU_eventRotateSystemMenu(direction);
		return;
	}

	uint8_t current_page = systemMenuIndex / LAYOUT->SYSMENU_MAX_ITEMS_ON_PAGE;
	LCD_busy = true;
	LCDDriver_drawFastHLine(0, (5 + (systemMenuIndex - current_page * LAYOUT->SYSMENU_MAX_ITEMS_ON_PAGE) * LAYOUT->SYSMENU_ITEM_HEIGHT) + 17, LAYOUT->SYSMENU_W, BG_COLOR);
	LCD_busy = false;
	if (direction < 0)
	{
		if (systemMenuIndex > 0)
			systemMenuIndex--;
		else if (!SYSMENU_hiddenmenu_enabled && sysmenu_onroot)
			systemMenuIndex = *sysmenu_item_count_selected - 2;
		else
			systemMenuIndex = *sysmenu_item_count_selected - 1;
	}
	else
	{
		if (systemMenuIndex < (*sysmenu_item_count_selected - 1))
		{
			systemMenuIndex++;
		}
		else
			systemMenuIndex = 0;
	}
	if (!SYSMENU_hiddenmenu_enabled && sysmenu_handlers_selected[systemMenuIndex].type == SYSMENU_HIDDEN_MENU)
		systemMenuIndex = 0;
	while (systemMenuIndex > 0 && sysmenu_handlers_selected[systemMenuIndex].type == SYSMENU_INFOLINE)
		systemMenuIndex = 0;

	LCD_UpdateQuery.SystemMenuCurrent = true;
	if (sysmenu_onroot)
		systemMenuRootIndex = systemMenuIndex;
	uint8_t new_page = systemMenuIndex / LAYOUT->SYSMENU_MAX_ITEMS_ON_PAGE;

	if (current_page != new_page)
		LCD_UpdateQuery.SystemMenuRedraw = true;
}

